HadyBazzi/ESP32_AI_Connect/src/AI_API_DeepSeek.cpp
// ESP32_AI_Connect/AI_API_DeepSeek.cpp

#include "ESP32_AI_Connect_config.h" // Include config first

#ifdef USE_AI_API_DEEPSEEK // Only compile this file's content if flag is set

#include "AI_API_DeepSeek.h"

String AI_API_DeepSeek_Handler::getEndpoint(const String& modelName, const String& apiKey, const String& customEndpoint) const {
    if (customEndpoint.length() > 0) {
        return customEndpoint;
    }
    return "https://api.deepseek.com/v1/chat/completions";
}

void AI_API_DeepSeek_Handler::setHeaders(HTTPClient& httpClient, const String& apiKey) {
    httpClient.addHeader("Content-Type", "application/json");
    httpClient.addHeader("Authorization", "Bearer " + apiKey);
}

String AI_API_DeepSeek_Handler::buildRequestBody(const String& modelName, const String& systemRole,
                                                float temperature, int maxTokens,
                                                const String& userMessage, JsonDocument& doc,
                                                const String& customParams) {
    doc.clear();

    doc["model"] = modelName;
    
    JsonArray messages = doc["messages"].to<JsonArray>();
    if (systemRole.length() > 0) {
        JsonObject systemMsg = messages.add<JsonObject>();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemRole;
    }
    JsonObject userMsg = messages.add<JsonObject>();
    userMsg["role"] = "user";
    userMsg["content"] = userMessage;

    // Process custom parameters if provided
    if (customParams.length() > 0) {
        // Create a temporary document to parse the custom parameters
        JsonDocument paramsDoc;
        DeserializationError error = deserializeJson(paramsDoc, customParams);
        
        // Only proceed if parsing was successful
        if (!error) {
            // Add each parameter from customParams to the request
            for (JsonPair param : paramsDoc.as<JsonObject>()) {
                // Skip model and messages as they are handled separately
                if (param.key() != "model" && param.key() != "messages") {
                    // Copy the parameter to our request document
                    doc[param.key()] = param.value();
                }
            }
        }
    }
    
    // Add standard parameters if set (these override any matching custom parameters)
    if (temperature >= 0.0) doc["temperature"] = temperature;
    if (maxTokens > 0) doc["max_tokens"] = maxTokens; // DeepSeek uses max_tokens instead of max_completion_tokens

    String requestBody;
    serializeJson(doc, requestBody);
    return requestBody;
}

String AI_API_DeepSeek_Handler::parseResponseBody(const String& responsePayload,
                                                 String& errorMsg, JsonDocument& doc) {
    resetState(); // Reset finish reason and tokens before parsing
    doc.clear();
    errorMsg = ""; // Clear previous error

    DeserializationError error = deserializeJson(doc, responsePayload);
    if (error) {
        errorMsg = "JSON Deserialization failed: " + String(error.c_str());
        return "";
    }

    if (!doc["error"].isNull()) {
        errorMsg = String("API Error: ") + (doc["error"]["message"] | "Unknown error");
        return "";
    }

    // Extract total tokens if available
    if (doc["usage"].is<JsonObject>()) {
        JsonObject usage = doc["usage"];
        if (!usage["total_tokens"].isNull()) {
            _lastTotalTokens = usage["total_tokens"].as<int>(); // Store in base class member
        }
    }

    if (doc["choices"].is<JsonArray>() && doc["choices"].size() > 0) {
       JsonObject firstChoice = doc["choices"][0];

       // Extract finish reason if available
       if (!firstChoice["finish_reason"].isNull()) {
           _lastFinishReason = firstChoice["finish_reason"].as<String>(); // Store in base class member
       }

       if (firstChoice["message"].is<JsonObject>()) {
           JsonObject message = firstChoice["message"];
           if (message["content"].is<const char*>()) {
               return message["content"].as<String>();
           }
       }
    }

    errorMsg = "Could not find 'choices[0].message.content' in response.";
    return ""; // Return empty string if content not found
}

#ifdef ENABLE_STREAM_CHAT
String AI_API_DeepSeek_Handler::buildStreamRequestBody(const String& modelName, const String& systemRole,
                                                      float temperature, int maxTokens,
                                                      const String& userMessage, JsonDocument& doc,
                                                      const String& customParams) {
    // Use the same logic as buildRequestBody but add "stream": true
    doc.clear();

    doc["model"] = modelName;
    doc["stream"] = true; // Enable streaming
    
    JsonArray messages = doc["messages"].to<JsonArray>();
    if (systemRole.length() > 0) {
        JsonObject systemMsg = messages.add<JsonObject>();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemRole;
    }
    JsonObject userMsg = messages.add<JsonObject>();
    userMsg["role"] = "user";
    userMsg["content"] = userMessage;

    // Process custom parameters if provided
    if (customParams.length() > 0) {
        // Create a temporary document to parse the custom parameters
        JsonDocument paramsDoc;
        DeserializationError error = deserializeJson(paramsDoc, customParams);
        
        // Only proceed if parsing was successful
        if (!error) {
            // Add each parameter from customParams to the request
            for (JsonPair param : paramsDoc.as<JsonObject>()) {
                // Skip model, messages, stream as they are handled separately
                if (param.key() != "model" && param.key() != "messages" && param.key() != "stream") {
                    // Copy the parameter to our request document
                    doc[param.key()] = param.value();
                }
            }
        }
    }
    
