HadyBazzi/ESP32_AI_Connect/src/AI_API_DeepSeek.cpp
    // Add standard parameters if set (these override any matching custom parameters)
    if (temperature >= 0.0) doc["temperature"] = temperature;
    if (maxTokens > 0) doc["max_tokens"] = maxTokens; // DeepSeek uses max_tokens instead of max_completion_tokens

    String requestBody;
    serializeJson(doc, requestBody);
    return requestBody;
}

String AI_API_DeepSeek_Handler::processStreamChunk(const String& rawChunk, bool& isComplete, String& errorMsg) {
    resetState(); // Reset state for each chunk
    isComplete = false;
    errorMsg = "";

    // DeepSeek uses the same Server-Sent Events (SSE) format as OpenAI
    // Format: "data: {json}\n" or "data: [DONE]\n"
    
    if (rawChunk.isEmpty()) {
        return "";
    }

    // Check for completion marker
    if (rawChunk.indexOf("[DONE]") != -1) {
        isComplete = true;
        return "";
    }

    // Look for "data: " prefix
    int dataIndex = rawChunk.indexOf("data: ");
    if (dataIndex == -1) {
        // Not a data line, skip
        return "";
    }

    // Extract JSON part after "data: "
    String jsonPart = rawChunk.substring(dataIndex + 6); // 6 = length of "data: "
    jsonPart.trim(); // Remove any whitespace

    if (jsonPart.isEmpty() || jsonPart == "[DONE]") {
        if (jsonPart == "[DONE]") {
            isComplete = true;
        }
        return "";
    }

    // Parse the JSON chunk
    JsonDocument chunkDoc;
    DeserializationError error = deserializeJson(chunkDoc, jsonPart);
    if (error) {
        errorMsg = "Failed to parse streaming chunk JSON: " + String(error.c_str());
        return "";
    }

    // Check for error in the chunk
    if (!chunkDoc["error"].isNull()) {
        errorMsg = String("API Error in stream: ") + (chunkDoc["error"]["message"] | "Unknown error");
        return "";
    }

    // Extract content from delta.content (same format as OpenAI)
    if (chunkDoc["choices"].is<JsonArray>() && 
        chunkDoc["choices"].size() > 0) {
        
        JsonObject firstChoice = chunkDoc["choices"][0];
        
        // Check finish_reason for completion
        if (!firstChoice["finish_reason"].isNull() && 
            !firstChoice["finish_reason"].isNull()) {
            isComplete = true;
            _lastFinishReason = firstChoice["finish_reason"].as<String>();
        }
        
        // Extract delta content
        if (firstChoice["delta"].is<JsonObject>()) {
            JsonObject delta = firstChoice["delta"];
            if (delta["content"].is<const char*>()) {
                return delta["content"].as<String>();
            }
        }
    }

    return ""; // No content in this chunk
}
#endif

#ifdef ENABLE_TOOL_CALLS
String AI_API_DeepSeek_Handler::buildToolCallsRequestBody(const String& modelName,
                                                         const String* toolsArray, int toolsArraySize,
                                                         const String& systemMessage, const String& toolChoice,
                                                         int maxTokens,
                                                         const String& userMessage, JsonDocument& doc) {
    // Clear the document first
    doc.clear();

    // Set the model
    doc["model"] = modelName;
    
    // Add max_tokens parameter if specified (DeepSeek uses max_tokens)
    if (maxTokens > 0) {
        doc["max_tokens"] = maxTokens;
    }
    
    // Add messages array
    JsonArray messages = doc["messages"].to<JsonArray>();
    
    // Add system message if specified
    if (systemMessage.length() > 0) {
        JsonObject systemMsg = messages.add<JsonObject>();
        systemMsg["role"] = "system";
        systemMsg["content"] = systemMessage;
    }
    
    // Add user message
    JsonObject userMsg = messages.add<JsonObject>();
    userMsg["role"] = "user";
    userMsg["content"] = userMessage;
    
    // Add tool_choice if specified (same format as OpenAI)
    if (toolChoice.length() > 0) {
        String trimmedChoice = toolChoice;
        trimmedChoice.trim();
        
        // Check if it's one of the allowed string values
        if (trimmedChoice == "auto" || trimmedChoice == "none" || trimmedChoice == "required") {
            // Simple string values can be added directly
            doc["tool_choice"] = trimmedChoice;
        } 
        // Check if it starts with { - might be a JSON object string
        else if (trimmedChoice.startsWith("{")) {
            // Try to parse it as a JSON object
            JsonDocument toolChoiceDoc;
            DeserializationError error = deserializeJson(toolChoiceDoc, trimmedChoice);
            
            if (!error) {
                // Successfully parsed as JSON - add as an object
                JsonObject toolChoiceObj = doc["tool_choice"].to<JsonObject>();
                
                // Copy all fields from the parsed JSON
                for (JsonPair kv : toolChoiceDoc.as<JsonObject>()) {
                    if (kv.value().is<JsonObject>()) {
                        JsonObject subObj = toolChoiceObj[kv.key().c_str()].to<JsonObject>();
                        JsonObject srcSubObj = kv.value().as<JsonObject>();
                        
                        for (JsonPair subKv : srcSubObj) {
                            subObj[subKv.key().c_str()] = subKv.value();
                        }
                    } else {
                        toolChoiceObj[kv.key().c_str()] = kv.value();
                    }
                }
            } else {
                // Not valid JSON - add as string but this will likely cause an API error
                #ifdef ENABLE_DEBUG_OUTPUT
                Serial.println("Warning: tool_choice value is not valid JSON: " + trimmedChoice);
                #endif
                doc["tool_choice"] = trimmedChoice;
            }
        } else {
            // Not a recognized string value or JSON - add as string but will likely cause an API error
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.println("Warning: tool_choice value is not recognized: " + trimmedChoice);
            #endif
            doc["tool_choice"] = trimmedChoice;
        }
    }
    
    // Add tools array (same format as OpenAI)
    JsonArray tools = doc["tools"].to<JsonArray>();
    
    // Parse and add each tool from the toolsArray
    for (int i = 0; i < toolsArraySize; i++) {
        // Create a temporary JsonDocument to parse the tool JSON string
        JsonDocument tempDoc;
        DeserializationError error = deserializeJson(tempDoc, toolsArray[i]);
        
        if (error) {
            // Skip invalid JSON
            continue;
        }
        
        // Check if the tool is already in OpenAI format (has 'type' and 'function' fields)
        if (!tempDoc["type"].isNull() && !tempDoc["function"].isNull()) {
            // Already in OpenAI format - copy directly to tools array
            JsonObject tool = tools.add<JsonObject>();
            
            // Copy type
            tool["type"] = tempDoc["type"];
            
            // Copy function
            JsonObject function = tool["function"].to<JsonObject>();
            JsonObject srcFunction = tempDoc["function"];
            
